[
  {
    "descripcion": "Seguimos creciendo y queremos contar con el mejor talento. Importante empresa se encuentra en búsqueda de Líder Técnico de Desarrollo e Integraciones. Perfil Requerido Profesional en Ingeniería de Sistemas, Desarrollo de Software o afines. con Especialización en Gerencia de Proyectos de TI, u otras a Fines (deseable). Experiencia certificada de 3 Años Siendo Desarrollador Senior, Deseable en proyectos integración de sistemas de ERP y/o softwares empresariales y 2 años Como Líder de Técnico. Importante Conocimientos sólidos en: Plataformas y frameworks de E-commerce (Shopify, Magento, WooCommerce, VTEX, o similares). Lenguajes de programación (PHP, JavaScript, Node.js, C#, u otros aplicables). Bases de datos relacionales y no relacionales (MySQL, SQL Server, MongoDB, etc.). Integración de pasarelas de pago y APIs. Arquitectura de software, seguridad y escalabilidad. Habilidades de liderazgo, comunicación asertiva y gestión de proyectos ágiles (Scrum, Kanban). Responsabilidades Liderar el equipo técnico de desarrollo en proyectos de E-commerce. Diseñar, implementar y optimizar soluciones digitales robustas y escalables. Asegurar la calidad del software mediante buenas prácticas de desarrollo y pruebas. Coordinar integraciones con sistemas internos y externos. Mantenerse actualizado en tendencias y tecnologías de comercio electrónico. Acompañar al equipo en la resolución de problemas técnicos complejos. Que Ofrecemos: Contrato a término indefinido. Salario competitivo acorde al Cargo y a la experiencia. Beneficios extralegales y oportunidades de crecimiento. Ambiente de trabajo colaborativo, innovador y retador. Modalidad: Presencial- Lunes a Viernes Palabras clave: jefe, gerente, manager, director, chief, lead, jefatura, regente Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "Interfaces y soluciones",
    "fecha_publicacion": "2025-09-22T15:12:19.348765",
    "fuente": "Computrabajo",
    "id": 104,
    "titulo": "Líder de desarrollo",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-lider-de-desarrollo-backend-en-medellin-5A841E3D1B2EB69A61373E686DCF3405#lc=ListOffers-Score5-13"
  },
  {
    "descripcion": "Importante: La labor es presencial en Bello (Antioquia), si no se ajusta a este tipo de modalidad, por favor no postularse. En GMA Digital, empresa de desarrollo de software, estamos en la búsqueda de desarrolladores con experiencia y conocimientos en: - Desarrollo PHP nativo, HTML5, CSS3, Bootstrap, JavaScript, JQuery, AJAX y JSON. - Bases de datos SQL (MySQL, SQL Server). - Control de versiones (GIT). - Programación orientada a objetos (PHP POO). - Laravel ^8 - Vue.js ^3 Conocimientos deseables (no excluyentes): - Desarrollo móvil en Quasar - Conocimientos en desarrollo para inteligencia artificial Requisitos: - Experiencia mínima de 2 años en desarrollo de software. - Habilidad para trabajar en equipo, seguir buenas prácticas y aplicar estándares de código. Notas: - Modalidad: Presencial. - El aspirante debe estar radicado en Medellín, Bello o municipios del Valle de Aburrá (Antioquia). - Postulaciones de aspirantes de otras ciudades no serán tenidas en cuenta. - Horario: lunes a jueves de 7:00 a.m. a 5:00 p.m. | viernes: 7:00 a.m. a 4:00 p.m. Palabras clave: developer, programador Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,1 GMA DIGITAL S.A.S.",
    "fecha_publicacion": "2025-09-23T05:12:19.334664",
    "fuente": "Computrabajo",
    "id": 100,
    "titulo": "Desarrollador de software",
    "ubicacion": "Bello, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador-de-software-presencial-en-bello-7A121F338AA63DD961373E686DCF3405#lc=ListOffers-Score6-0"
  },
  {
    "descripcion": "Importante empresa del sector salud, requiere para su equipo de trabajo personal con formación profesional en tecnologías de la información y la comunicación o áreas afines como ingeniería de sistemas, ingeniería de software o desarrollo de aplicaciones, que cuente con 4 años de experiencia en desarrollo de software. Misión del cargo: Realizar y asegurar el continuo desarrollo de software, de acuerdo con las necesidades institucionales, la metodología de desarrollo definida y la normatividad legal vigente; con el fin de contribuir al establecimiento de una plataforma de aplicaciones y software que soporten la operación asistencial y administrativa. Funciones específicas: Desarrollar o adaptar aplicaciones informáticas conforme a los requisitos de usuario, los lenguajes de programación y la metodología definida; con el fin de soportar, mejorar y optimizar la operación de los servicios asistenciales, administrativos y comerciales del Hospital. Planear, diseñar y desarrollar proyectos de software de acuerdo con las historias de usuario documentadas por el Product Owner. Construir clases y métodos que permitan hacer uso de procedimientos almacenados e implementar la lógica que el negocio requiere. Operar los diferentes ambientes de programación: Testing, Integración y Producción. Realizar pruebas funcionales y pruebas pares para validar funcionalidad y adherencia al prototipo establecido. Conocimiento: Diseño y desarrollo de aplicaciones. Gestión de bugs. Gestión de soporte técnico. Validación y verificación. Competencias: Gestión del riesgo. Mejoramiento continuo. Docencia servicio. Trato humanizado. Orientación al servicio. Iniciativa/autonomía. Orientación a resultados. Salario: $6.406.923 + prestaciones sociales + beneficios extralegales. Horarios: Lunes a viernes de 7:00 a.m. a 5:00 p.m. Tipo de contrato: Fijo. Lugar de trabajo: Medellín. Palabras clave: developer, programador Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,8 AGENCIA DE EMPLEO COMFAMA",
    "fecha_publicacion": "2025-09-20T07:12:19.343384",
    "fuente": "Computrabajo",
    "id": 101,
    "titulo": "Desarrollador/a de Software",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrolladora-de-software-4-anos-de-experiencia-en-medellin-5FCFDF5EF1542DAE61373E686DCF3405#lc=ListOffers-Score6-2"
  },
  {
    "descripcion": "En Soluciones Redy estamos en la búsqueda de un aprendiz administrativo como tú, que sienta pasión por gestionar y apoyar los diferentes procesos en sistemas que se presentan en la organización, que disfrute trabajar en equipo, aprender y asumir nuevos retos. Para hacer parte de nuestro equipo solo es necesario que estés estudiando una carrera TÉCNICA o TECNOLÓGICA en sistemas o redes y que cuentes con el aval de tu institución educativa para iniciar prácticas de manera inmediata. Qué ofrecemos: - Contrato de aprendizaje por convenio SENA - Auxilio de sostenimiento del 100% del SMLV - Mentoría, aprendizaje y fortalecimiento de tu perfil. !Postúlate y se parte de nuestra gran gran equipo de trabajo¡ Palabras clave: apprentice, internship, traine, apoyo, support, soporte, tecnologo, tecnico, tech, technician, technology, tecnologia, technologist, maintenance, conservacion, conservation, mantenimiento Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "Redy",
    "fecha_publicacion": "2025-09-23T06:15:19.345421",
    "fuente": "Computrabajo",
    "id": 102,
    "titulo": "Aprendiz Soporte técnico primer nivel (No valido para desarrolladores de software)",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-aprendiz-soporte-tecnico-primer-nivel-no-valido-para-desarrolladores-de-software-mantenimiento-de-equipos-en-medellin-DFBEE59D93DC170A61373E686DCF3405#lc=ListOffers-Score6-8"
  },
  {
    "descripcion": "Empresa del sector Retail, solicita Analista de Desarrollador, para Crear y desarrollar nuevos programas o sistemas, evaluar y mejorar sistemas existentes o nuevos a través de framework de última generación que contribuyan a agilizar los procesos de los clientes internos. Con experiencia de 2 años como analista desarrollador debe ser tecnólogo, estudiante de últimos semestres o Profesional en sistemas, telecomunicaciones o Desarrollo de software o áreas afines. Habilidades y/o Conocimientos Conocimientos en base de datos. (SQL Server, MySql) Conocimientos en lógica de programación Orientada a Objetos. Conocimientos en lenguajes de programación backend y frontend. (C, NetCore, NodeJs, Angular, Async /Await, LINQ, Inyección de dependencias, singleton) Desarrollo de APIs y WebService. Se requiere experiencia en arquitecturas cliente-servidor o de n niveles, se prefiere experiencia en microservicios, RESTfull u orientada a servicios. Idealmente que el candidato haya trabajado en entornos Agiles. Software de control de versiones (Git), Conocimientos de principios SOLID. Que haya trabajado AZURE DEVOPS (CI/CD) Conocimiento de Docker (Creación de imágenes, Registry) Conocimientos en Kubernetes BENEFICIOS: -Tiquetera del bienestar -Fondo de empleados -Trabajo Híbrido -Descuentos en tiendas para ti y tus referidos Palabras clave: analyst Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,5 AGAVAL",
    "fecha_publicacion": "2025-09-22T17:12:19.347150",
    "fuente": "Computrabajo",
    "id": 103,
    "titulo": "Analista de Desarrollo Tecnológico",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-analista-de-desarrollo-tecnologico-en-medellin-AD91FD70E1591E3761373E686DCF3405#lc=ListOffers-Score5-12"
  },
  {
    "descripcion": "Título del Cargo: Supervisor(a) de Operaciones de I+D (Investigación y Desarrollo) Ubicación: Remoto desde Colombia, incluyendo las siguientes ciudades: Bogotá Barranquilla Bucaramanga Medellín Cali Armenia Oficina física disponible: CAMACOL  Cra 63 49A-31, Edificio Camacol, Barrio El Estadio, Piso 9 Nivel de Estudios Requerido: Título universitario en Administración de Empresas, Ingeniería, Ciencias de la Computación o áreas afines. También se considera experiencia práctica equivalente. Descripción del Cargo: El/la Supervisor(a) de Operaciones de I+D es responsable de coordinar y optimizar los aspectos operativos de las iniciativas de investigación y desarrollo. Este rol actúa como puente entre los equipos técnicos de I+D y los stakeholders del negocio, asegurando que los proyectos se entreguen de manera eficiente, alineados con los objetivos estratégicos y cumpliendo con los estándares internos y externos. Supervisará la ejecución de proyectos, gestionará la colaboración entre áreas y fomentará la mejora continua de los procesos de I+D. Responsabilidades Principales: Comunicación con Clientes y Desarrolladores: Ser el punto de contacto principal con los clientes. Facilitar reuniones regulares entre clientes y equipos de desarrollo. Traducir requerimientos del cliente en tareas claras para los desarrolladores. Gestionar escalaciones y prevenir problemas potenciales. Coordinación y Entrega de Proyectos: Supervisar la entrega de proyectos de desarrollo de software. Establecer hitos y entregables junto con líderes técnicos. Monitorear el progreso y actualizar a los clientes. Identificar y mitigar riesgos del proyecto. Gestión Administrativa y Contractual: Asegurar el cumplimiento de requisitos administrativos y de documentación. Reportar métricas clave del proyecto. Apoyar al equipo comercial con propuestas, SOWs y renovaciones. Mejora de Procesos y Satisfacción del Cliente: Evaluar y mejorar procesos de gestión de clientes. Recoger retroalimentación para mejorar la entrega de servicios. Representar tanto al cliente como al equipo de desarrollo. Participar en reuniones de éxito del cliente y coordinar acciones correctivas. Perfil Requerido: Hard Skills: Título universitario en Ingeniería, Ciencias de la Vida, Ciencias de la Computación o áreas afines. Experiencia en operaciones de I+D, coordinación de proyectos o gestión técnica de programas. Conocimiento de metodologías de investigación, ciclos de innovación y desarrollo de productos. Manejo de herramientas de gestión de proyectos (Jira, Asana, Trello). Conocimiento de estándares de cumplimiento (ISO, FDA u otros según la industria). Soft Skills: Excelentes habilidades de comunicación e interpersonales. Capacidad de liderazgo y coordinación de equipos. Mentalidad analítica, atención al detalle y resolución de problemas. Capacidad para gestionar múltiples proyectos en entornos dinámicos. Pasión por la innovación y la mejora continua. Strong skills with: Azure, MIcroservice Architecture, C, SQL, Unit Testing, .NET, Javascript, HTML Palabras clave: operaciones, residente, encargado, supervisor, subgerente, responsable, coordinador, gestor, capitan Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,6 SOLVO S.A.S",
    "fecha_publicacion": "2025-09-22T11:12:19.350437",
    "fuente": "Computrabajo",
    "id": 105,
    "titulo": "R and D Operations Supervisor",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-r-and-d-operations-supervisor-en-medellin-3D33D18FB72987AF61373E686DCF3405#lc=ListOffers-Score5-14"
  },
  {
    "descripcion": "Se requiere desarrollador de software con conocimientos en SQL Server, ASP.Net Core C #, Angular, Bootstrap, JavaScript, HTML, CSS y TypeScript. Responsabilidades: Diseñar y desarrollar módulos en nuestra aplicación web, con altos estándares de eficiencia y calidad Realizar pruebas de unidad y de integración para garantizar la estabilidad y el rendimiento de la aplicación Mantenerse actualizado en las últimas tendencias y avances en desarrollo de software Documentar el código y los procesos técnicos de manera clara y concisa Formación: Tecnólogo, Ingeniero de Sistemas o afines. Habilidades: iniciativa, capacidades analíticas e investigativas, orientación al detalle y al logro. Experiencia: 2 años en el área de desarrollo. Palabras clave: analyst, developer, programador Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,5 UBIQUO TELEMEDICINA S.A.S",
    "fecha_publicacion": "2025-09-22T09:12:19.352091",
    "fuente": "Computrabajo",
    "id": 106,
    "titulo": "analista desarrollador",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-analista-desarrollador-en-medellin-9CCF047915355F6761373E686DCF3405#lc=ListOffers-Score5-18"
  },
  {
    "descripcion": "Importante empresa solicita para su equipo de trabajo, personal con experiencia mínima de 6 meses para desempeñar el cargo de desarrollador/a web - WordPress. Formación académica: Técnico/a, tecnólogo/a o profesional en Mercadeo, Administración, Negocios, Ingeniería Comercial o afines. Funciones específicas: - Depurar bases de datos comerciales y verificar información de contacto. - Analizar y segmentar las bases de datos para priorizar empresas con mayor potencial. - Buscar nuevas empresas objetivo a través de herramientas y motores de búsqueda. - Enviar propuestas comerciales según plantillas preestablecidas. - Contactar patrocinadores o invitados especiales para eventos. Conocimientos: - Redacción de correos, propuestas comerciales y reportes claros y estructurados. - Llamadas con empresas patrocinadoras e invitados, seguimiento a oportunidades comerciales. - Comprender las necesidades del cliente o patrocinador. - Presentar propuestas y beneficios de forma atractiva y convincente. - Manejo de CRM, Excel intermedio-avanzado, herramientas de búsqueda y análisis (Google, LinkedIn). - Nociones básicas de marketing digital. - Google Workspace (Drive, Sheets, Docs), plataformas de automatización comercial, bases de datos en línea. Salario: $1.523.500 + comisiones de éxito + prestaciones de ley. Horarios: lunes a viernes 7:00 a.m. a 5:00 p.m. y sábados 8:00 a.m. a 12:00 m. Tipo de contrato: Fijo. Lugar de trabajo: Medellín, modalidad híbrida. Palabras clave: developer, programador, internet, web Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,8 AGENCIA DE EMPLEO COMFAMA",
    "fecha_publicacion": "2025-09-22T18:12:19.353868",
    "fuente": "Computrabajo",
    "id": 107,
    "titulo": "Desarrollador/a web WordPress",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrolladora-web-wordpress-en-medellin-98E75F3589CDFF0261373E686DCF3405#lc=ListOffers-Score6-0"
  },
  {
    "descripcion": "buscamos un Desarrollador Web con habilidades sólidas en programación y creatividad para el diseño y construcción de páginas web seguras, escalables y optimizadas. La persona seleccionada tendrá la oportunidad de trabajar estable en la empresa, aportando desde la escritura de código propio hasta el fortalecimiento de la seguridad informática y el posicionamiento digital. Funciones principales: - Desarrollo de páginas web con código propio (WordlPress o  Python.). - Implementación y personalización de WordPress. - Integración de funcionalidades avanzadas con Python (implementaremos nuevo ERP Oddo). - Aplicar mejores prácticas de ciberseguridad en los desarrollos web. - Conocimiento en Ecomerce. Opcional: Conocimiento en SEO, para optimizar la visibilidad de los sitios web. ** Lunes a Viernes: 7:30 am a 5:00 pm Sábado: 7:30 am a 12:00pm ** Salario: A Convenir ** Contrato: Fijo. Palabras clave: developer, programador, internet, web Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "CENTRO DE SERVICIO AUTOMOTRIZ MEGA S.A.S.",
    "fecha_publicacion": "2025-09-21T07:12:19.355867",
    "fuente": "Computrabajo",
    "id": 108,
    "titulo": "Desarrollador Web",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador-web-python-en-medellin-9D455E22EE54A23061373E686DCF3405#lc=ListOffers-Score6-1"
  },
  {
    "descripcion": "Importante empresa del sector de servicios, esta en busca de un Web Master en las ciudades Cúcuta, Barranquilla, Bogotá, Medellín y Florencia. para desarrollar las siguientes Funciones: - Desarrollo de módulos y nuevas funcionalidades para nuestras soluciones tecnológicas. - Implementación y mantenimiento de nuestras plataformas, asegurando su correcto funcionamiento y adaptabilidad a cada requerimiento. - Resolución de problemas técnicos y ajustes necesarios durante la implementación y postFUNCIONES - Desarrollo de módulos y nuevas funcionalidades para nuestras soluciones tecnológicas. - Implementación y mantenimiento de nuestras plataformas, asegurando su correcto funcionamiento y adaptabilidad a cada requerimiento. - Resolución de problemas técnicos y ajustes necesarios durante la implementación y postimplementación. EXPERIENCA Más de 2 años de experiencia como desarrollador de software Solidos conocimientos de PHP, HTML5, CSS, JavaScript y MySQL. (conocimientos en TypeScript sería un plus) Mínimo 2 años de experiencia en la implementación o co-implementación de proyectos, incluyendo interacción directa con clientes. Conocimientos sólidos en mecanismos de integración de datos, automatización de procesos, configuración y administración básica de servidores, gestión y configuración de PHP, así como instalación y administración básica de MySQL. implementación. Palabras clave: developer, programador, internet, web Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "VPA CREAR SAS",
    "fecha_publicacion": "2025-09-21T07:12:19.358061",
    "fuente": "Computrabajo",
    "id": 109,
    "titulo": "desarrollador/a web",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrolladora-web-desarrollador-web-en-medellin-BB19C9ABB18540FD61373E686DCF3405#lc=ListOffers-Score6-2"
  },
  {
    "descripcion": "Empresa del sector Retail, solicita Analista de Desarrollador, para Crear y desarrollar nuevos programas o sistemas, evaluar y mejorar sistemas existentes o nuevos a través de framework de última generación que contribuyan a agilizar los procesos de los clientes internos. Con experiencia de 2 años como analista desarrollador debe ser tecnólogo, estudiante de últimos semestres o Profesional en sistemas, telecomunicaciones o Desarrollo de software o áreas afines. Habilidades y/o Conocimientos Conocimientos en base de datos. (SQL Server, MySql) Conocimientos en lógica de programación Orientada a Objetos. Conocimientos en lenguajes de programación backend y frontend. (C, NetCore, NodeJs, Angular, Async /Await, LINQ, Inyección de dependencias, singleton) Desarrollo de APIs y WebService. Se requiere experiencia en arquitecturas cliente-servidor o de n niveles, se prefiere experiencia en microservicios, RESTfull u orientada a servicios. Idealmente que el candidato haya trabajado en entornos Agiles. Software de control de versiones (Git), Conocimientos de principios SOLID. Que haya trabajado AZURE DEVOPS (CI/CD) Conocimiento de Docker (Creación de imágenes, Registry) Conocimientos en Kubernetes BENEFICIOS: -Tiquetera del bienestar -Fondo de empleados -Trabajo Híbrido -Descuentos en tiendas para ti y tus referidos Palabras clave: analyst Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,5 AGAVAL",
    "fecha_publicacion": "2025-09-22T17:12:19.360371",
    "fuente": "Computrabajo",
    "id": 110,
    "titulo": "Analista de Desarrollo Tecnológico",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-analista-de-desarrollo-tecnologico-en-medellin-AD91FD70E1591E3761373E686DCF3405#lc=ListOffers-Score5-5"
  },
  {
    "descripcion": "Se requiere desarrollador de software con conocimientos en SQL Server, ASP.Net Core C #, Angular, Bootstrap, JavaScript, HTML, CSS y TypeScript. Responsabilidades: Diseñar y desarrollar módulos en nuestra aplicación web, con altos estándares de eficiencia y calidad Realizar pruebas de unidad y de integración para garantizar la estabilidad y el rendimiento de la aplicación Mantenerse actualizado en las últimas tendencias y avances en desarrollo de software Documentar el código y los procesos técnicos de manera clara y concisa Formación: Tecnólogo, Ingeniero de Sistemas o afines. Habilidades: iniciativa, capacidades analíticas e investigativas, orientación al detalle y al logro. Experiencia: 2 años en el área de desarrollo. Palabras clave: analyst, developer, programador Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,5 UBIQUO TELEMEDICINA S.A.S",
    "fecha_publicacion": "2025-09-22T09:12:19.362543",
    "fuente": "Computrabajo",
    "id": 111,
    "titulo": "analista desarrollador",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-analista-desarrollador-en-medellin-9CCF047915355F6761373E686DCF3405#lc=ListOffers-Score5-7"
  },
  {
    "descripcion": "¡Estamos buscando talento para nuestro equipo de desarrollo! Vacante: Desarrollador Fullstack (JavaScript) Ubicación: Medellín (Edificio Forum  El Poblado) Modalidad: Híbrida (2 días en oficina / 3 desde casa) Horario: Lunes a viernes de 7:30 a.m. a 5:30 p.m. Contrato: Término indefinido Salario: $5.000.000 a $6.000.000 COP (según experiencia) Requisitos: Tecnólogo o profesional en Ingeniería de Sistemas o Ingeniería Informática Mínimo 3 años de experiencia comprobable en desarrollo de software Dominio de Node.JS, Angular.JS y JavaScript Experiencia con SQL Server Deseable conocimiento en PL/SQL y manejo de sistemas operativos Habilidad para trabajar con web services, pruebas unitarias y procesos de integración Tus funciones incluirán: Monitorear y gestionar el rendimiento de aplicaciones web Atender incidencias y requerimientos técnicos de manera efectiva Desarrollar y mejorar funcionalidades en aplicaciones web Participar en la implementación de tecnologías back y front Colaborar en procesos de soporte, documentación y mejora continua ¿Qué ofrecemos? Contrato directo e indefinido Modalidad híbrida con excelente ubicación en Medellín Proyectos retadores en entornos tecnológicos modernos Oportunidades de formación continua y desarrollo profesional Un ambiente de trabajo colaborativo, flexible y orientado a la innovación ¿Te interesa? ¡Postúlate y haz parte de un equipo donde tu talento impulsa grandes soluciones Palabras clave: developer, programador Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,6 Adecco Colombia S.A.",
    "fecha_publicacion": "2025-09-21T07:12:19.364589",
    "fuente": "Computrabajo",
    "id": 112,
    "titulo": "Desarrollador Fullstack (JavaScript)",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador fullstack-javascript-en-medellin-0D8410FAD864AF9261373E686DCF3405#lc=ListOffers-Score6-0"
  },
  {
    "descripcion": "Oferta Laboral – Desarrollador Fullstack (Senior/Especialista) Medellín | Hibrido | Contrato por obra y labor Información General: Rol: Desarrollador Fullstack Tipo de contrato: Obra y labor Herramienta de trabajo: Máquina entregada por el cliente Perfil Técnico Requerido: Buscamos un profesional Fullstack altamente calificado, con experiencia comprobable en tecnologías modernas de backend, frontend y cloud, y con sólidas capacidades de liderazgo técnico. Requisitos técnicos (mandatorios): Experiencia sólida en Silla WebFlux (desarrollo reactivo con Spring WebFlux). Dominio de Node.js para desarrollo backend. Conocimientos en Angular (frontend). Experiencia trabajando con servicios y herramientas de AWS. Buena capacidad de liderazgo toma de decisiones técnicas y mentoría. Palabras clave: developer, programador, specialist, especialista Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,4 ZEMSANIA COLOMBIA SAS",
    "fecha_publicacion": "2025-09-20T07:12:19.366449",
    "fuente": "Computrabajo",
    "id": 113,
    "titulo": "Desarrollador FullStack Especialista",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador-fullstack-especialista-hibrido-en-medellin-en-medellin-877E79F207F8B2E061373E686DCF3405#lc=ListOffers-Score6-2"
  },
  {
    "descripcion": "Somos Fastco Group una compañía multinacional Líder de Contact Center, con más de 23 años de trayectoria, presencia en 5 países (Chile, Colombia, Perú, EE.UU. y España) y un firme compromiso con la transformación digital del Contact Center. Nos encontramos en la búsqueda de un(a) Desarrollador(a) Fullstack Senior con sólida experiencia técnica, visión estratégica, foco en Python y experiencia comprobada en frameworks para agentes de IA como LangChain y LangGraph, para unirse al equipo de Innovación Tecnológica. Requisitos: - Formación académica a nivel profesional o técnico profesional en las áreas de informática, programación, desarrollo de software, tecnología, inteligencia artificial, o carreras afines. - Experiencia en desarrollo de software, con participación en proyectos complejos o de alta demanda. - Dominio de Python, con enfoque en orquestación, automatización y procesamiento de lenguaje natural. - Experiencia comprobable usando LangChain y LangGraph, incluyendo diseño de flujos, agentes, herramientas y memory. - Conocimiento de IA generativa y uso de LLMs para tareas prácticas (ej: automatizar llamadas, evaluar calidad, generar acciones). - Conocimientos de desarrollo frontend con Vue 3 y TypeScript para construir interfaces operativas modernas. - Conocimiento de integración con servicios externos vía API, flujos de negocio y automatización de procesos. - Experiencia en infraestructura cloud (AWS) y despliegue de soluciones escalables. -  Habilidad para diseñar arquitecturas modulares, reutilizables y seguras. Perfil profesional que buscamos: - Autonomía para diseñar y entregar soluciones end-to-end. - Pensamiento estructurado y enfoque práctico. - Curiosidad por lo nuevo: no solo usar IA, sino programarla. - Buena comunicación con equipos no técnicos. - Mentalidad de mejora continua y ganas de experimentar con tecnologías emergentes. Ofrecemos: •Contrato a término indefinido •Salario competitivo acorde al mercado. •Participación en proyectos desafiantes y de alto impacto en innovación tecnológica. •Autonomía técnica y espacio para experimentar con nuevas herramientas. •Cultura de trabajo ágil, colaborativa y orientada a generar valor real. •Modalidad híbrida. •Contrato directo con la empresa y oportunidades de desarrollo profesional. •Excelente ambiente laboral y cultura organizacional basada en el compromiso, la innovación y el bienestar. Si buscas llevar tu carrera al siguiente nivel y construir soluciones innovadoras desde la tecnología y la IA, postula y únete a un gran equipo. Adjúntanos tu CV actualizado por este medio Palabras clave: senior, sr Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,2 Fastco SAS",
    "fecha_publicacion": "2025-09-22T09:12:19.368218",
    "fuente": "Computrabajo",
    "id": 114,
    "titulo": "Desarrollador(a) Fullstack Senior – Agentes de IA y Orquestación con Python Híbrido",
    "ubicacion": "Bogotá, D.C., Bogotá, D.C.",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrolladora-fullstack-senior-agentes-de-ia-y-orquestacion-con-python-hibrido-en-bogota-dc-F1788C429F8C0DF061373E686DCF3405#lc=ListOffers-Score4-11"
  },
  {
    "descripcion": "BUSCAMOS:  Ingenieros de  Sistemas o carreras afines con experiencia mínima de 2 a 3 años en desarrollo de Software y Full stack. Conocimientos y experiencia específicos en .NET, Angular, CSS,  ASP.NET, JQuery, Bootstrap. Bases de datos: SQL Server. Nivel: Profesional Semisenior. Estudios: Tecnólogo – Ingeniero de sistemas. Nivel Ingles:  Intermedio. Funciones: Desarrollo full stack. Levantamiento de requerimientos. Manejo de cambios, despliegues. Creación de queries, procedimientos almacenados, reportes. Condiciones Laborales:  Trabajo Remoto. Contrato: Obra o labor. Salario: $4.300.000 Palabras clave: developer, programador, dotnet, net, net, engineers, ingeniera, ing, engineer, system Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "Importante empresa del sector",
    "fecha_publicacion": "2025-09-21T07:12:19.370164",
    "fuente": "Computrabajo",
    "id": 115,
    "titulo": "Desarrollador .NET Fullstack",
    "ubicacion": "Bogotá, D.C., Bogotá, D.C.",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-comercial-bogota-en-bogota-dc-523BD0ED36AD7B2961373E686DCF3405#lc=ListOffers-Score4-18"
  },
  {
    "descripcion": "Empresa del sector Retail, solicita Analista de Desarrollador, para Crear y desarrollar nuevos programas o sistemas, evaluar y mejorar sistemas existentes o nuevos a través de framework de última generación que contribuyan a agilizar los procesos de los clientes internos. Con experiencia de 2 años como analista desarrollador debe ser tecnólogo, estudiante de últimos semestres o Profesional en sistemas, telecomunicaciones o Desarrollo de software o áreas afines. Habilidades y/o Conocimientos Conocimientos en base de datos. (SQL Server, MySql) Conocimientos en lógica de programación Orientada a Objetos. Conocimientos en lenguajes de programación backend y frontend. (C, NetCore, NodeJs, Angular, Async /Await, LINQ, Inyección de dependencias, singleton) Desarrollo de APIs y WebService. Se requiere experiencia en arquitecturas cliente-servidor o de n niveles, se prefiere experiencia en microservicios, RESTfull u orientada a servicios. Idealmente que el candidato haya trabajado en entornos Agiles. Software de control de versiones (Git), Conocimientos de principios SOLID. Que haya trabajado AZURE DEVOPS (CI/CD) Conocimiento de Docker (Creación de imágenes, Registry) Conocimientos en Kubernetes BENEFICIOS: -Tiquetera del bienestar -Fondo de empleados -Trabajo Híbrido -Descuentos en tiendas para ti y tus referidos Palabras clave: analyst Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,5 AGAVAL",
    "fecha_publicacion": "2025-09-22T17:12:19.372375",
    "fuente": "Computrabajo",
    "id": 116,
    "titulo": "Analista de Desarrollo Tecnológico",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-analista-de-desarrollo-tecnologico-en-medellin-AD91FD70E1591E3761373E686DCF3405#lc=ListOffers-Score5-6"
  },
  {
    "descripcion": "Estamos en búsqueda de Desarrolladores Full Stack que deseen unirse a un equipo dinámico y aportar en la creación de productos digitales innovadores con impacto real. Responsabilidades Desarrollar y mantener aplicaciones web y móviles. Diseñar e implementar APIs y servicios backend eficientes. Colaborar con los equipos de diseño y producto para crear interfaces modernas y fáciles de usar. Garantizar la calidad del código, optimizar el rendimiento y participar en revisiones técnicas. Mantenerse actualizado con las últimas tendencias y tecnologías. Requisitos Experiencia en desarrollo frontend con React, Angular o Vue.js. Conocimientos sólidos en backend con Node.js, Python, Java o PHP. Experiencia en desarrollo de aplicaciones móviles nativas o híbridas. Manejo de bases de datos SQL y NoSQL. Experiencia en sistemas de control de versiones (preferiblemente Git). Proactividad, capacidad de trabajo en equipo y autonomía. Se valorará Experiencia con servicios en la nube (AWS, Azure o GCP). Conocimientos en diseño UI/UX. Certificaciones o proyectos relevantes en desarrollo de software. Palabras clave: engineers, ingeniera, ing, engineer Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "PEDBOX S.A.S.",
    "fecha_publicacion": "2025-09-21T07:12:19.374593",
    "fuente": "Computrabajo",
    "id": 117,
    "titulo": "Ingeniero de software",
    "ubicacion": "Itagüí, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-ingeniero-de-software-frontend-backend-movil-en-itagui-19CC92DFF3CAE41461373E686DCF3405#lc=ListOffers-Score5-10"
  },
  {
    "descripcion": "Somos XpertGroup, una compañía enfocada en el desarrollo de software, analítica avanzada, Big data, DevSecOps, Agilísimo. Contamos con productos tanto propios como a la medida del cliente y actualmente nos encontramos en la búsqueda de un Desarrollador Full Stack NodeJS - Angular, para que forme parte de nuestra familia de xpertlovers. Debe Contar Con Conocimientos En Backend: Dominio de Node.js/Express.js para la creación de APIs RESTful, implementación de middleware y sistemas de autenticación. Deseable: Conocimientos en Node-RED, Python y/o Java. Base de Datos: Experiencia avanzada en PostgreSQL, incluyendo el diseño y optimización de queries complejas. Frontend: Experto en Angular y TypeScript. DevOps: Sólida experiencia con CI/CD en Azure DevOps y Docker. Observabilidad: Familiaridad con herramientas como Dynatrace y ArgoCD. Habilidades Clave Conocimientos en Hacking Ético. Experiencia en Quality Gates (QG) con SonarCloud. Manejo avanzado de estrategias de Git branching. Arquitectura (Deseable) Diseño y aplicación de patrones de diseño. Experiencia con arquitecturas de microservicios y sistemas basados en eventos. Tecnologías Complementarias Testing: Experiencia con frameworks como Vitest. ORMs: Conocimiento de Sequelize y/o TypeORM. Plataformas Cloud: Experiencia con AWS. Si te encuentras interesado puedes enviarnos tu hoja de vida y aspiración salarial al correo: *******.******@xpertgroup.co Al enviar tu solicitud para esta vacante, usted autoriza a XpertGroup a recopilar, almacenar y procesar sus datos personales para fines de selección y contratación, estos datos se utilizaran únicamente para la gestión de la solicitud y se mantendrán confidenciales Ley 1581- del 2012 Palabras clave: developer, programador Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "XpertGroup",
    "fecha_publicacion": "2025-09-20T07:12:19.376726",
    "fuente": "Computrabajo",
    "id": 118,
    "titulo": "Desarrollador Full Stack NodeJS  Angular",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador-full-stack-nodejs-angular-en-medellin-2A8D3C1A7308AFB761373E686DCF3405#lc=ListOffers-Score5-12"
  },
  {
    "descripcion": "Oferta Laboral – Desarrollador Fullstack (Senior/Especialista) Medellín | Hibrido | Contrato por obra y labor Información General: Rol: Desarrollador Fullstack Tipo de contrato: Obra y labor Herramienta de trabajo: Máquina entregada por el cliente Perfil Técnico Requerido: Buscamos un profesional Fullstack altamente calificado, con experiencia comprobable en tecnologías modernas de backend, frontend y cloud, y con sólidas capacidades de liderazgo técnico. Requisitos técnicos (mandatorios): Experiencia sólida en Silla WebFlux (desarrollo reactivo con Spring WebFlux). Dominio de Node.js para desarrollo backend. Conocimientos en Angular (frontend). Experiencia trabajando con servicios y herramientas de AWS. Buena capacidad de liderazgo toma de decisiones técnicas y mentoría. Palabras clave: developer, programador, specialist, especialista Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,4 ZEMSANIA COLOMBIA SAS",
    "fecha_publicacion": "2025-09-20T07:12:19.378549",
    "fuente": "Computrabajo",
    "id": 119,
    "titulo": "Desarrollador FullStack Especialista",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador-fullstack-especialista-hibrido-en-medellin-en-medellin-877E79F207F8B2E061373E686DCF3405#lc=ListOffers-Score5-13"
  },
  {
    "descripcion": "¡Únete a nuestro equipo en AffiniPay! Estamos en busca de un/a Ingeniero/a Senior Full Stack para potenciar nuestra innovadora plataforma de procesamiento de pagos. Con nuestra solución personalizada, procesamos transacciones grandes en un entorno seguro, manteniéndonos como líderes en la industria a nivel nacional. En este rol, contribuirás a la creación e implementación de nuevas funcionalidades sobre la plataforma actual y mejorarás la usabilidad para nuestros clientes utilizando Ruby on Rails, jQuery y React. ¿Qué harás? Participar en discusiones técnicas y diseño de nuevas soluciones. Colaborar con el equipo de producto en la mejora de la experiencia de usuario. Evaluar la viabilidad de soluciones frontend para un diseño técnico óptimo. Liderar la implementación de nuevas funcionalidades. Trabajar en la mejora continua de procesos y tecnologías. Mentorear a desarrolladores y colaborar en programación en pareja. Contribuir en revisiones de código para garantizar la calidad del software. Desplegar y gestionar aplicaciones en AWS con el equipo de operaciones. Sobre ti: Título universitario en Ingeniería Informática, o experiencia laboral equivalente. Más de 5 años de experiencia en desarrollo de software. Sólida experiencia con Ruby on Rails. Conocimiento en diversas tecnologías web, destacando React. Experiencia en la escritura de automatizaciones. Habilidades en construir APIs en formato JSON. Familiaridad con herramientas como Kubernetes, Helm y Docker. Experiencia en aplicaciones web en producción y a gran escala. Resolución de problemas de rendimiento en aplicaciones complejas. Conocimiento en sistemas distribuidos y arquitectura de software. Experiencia con SQL y bases de datos como PostgreSQL o MySQL. Habilidad para depurar problemas complejos con herramientas interactivas. Experiencia orientando y mentorando desarrolladores de diferentes niveles. Palabras clave: senior, sr, ingeniero, engineers, ingeniera, ing, engineer, casa, remoto, remote, teletrabajo, home Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,6 PeakU",
    "fecha_publicacion": "2025-09-20T07:12:19.380318",
    "fuente": "Computrabajo",
    "id": 120,
    "titulo": "Senior Software Engineer Ruby React 38628",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-senior-software-engineer-ruby-react-38628-remoto-en-medellin-EA28E3BB10DFBA7E61373E686DCF3405#lc=ListOffers-Score5-14"
  },
  {
    "descripcion": "¡En MOK Colombia estamos en búsqueda de nuestro próximo Desarrollador Senior Frontend! ¿Cuál será tu misión? Desarrollar requerimientos o proyectos de software alineados con la estrategia organizacional, garantizando su implementación y estabilización en la infraestructura tecnológica de Grupo MOK. Responsabilidades clave -Estimar historias de usuario y desarrollar funcionalidades. -Proponer soluciones técnicas y asegurar cumplimiento de especificaciones. -Realizar pruebas, mantenimiento y soporte técnico. -Documentar instalaciones en producción y participar en el levantamiento de requerimientos. Profesional en Ingeniería de Sistemas, Tecnologías de la Información o carreras afines. Experiencia requerida: +4 años en desarrollo web con React (Custom Hooks, Context, Router v6, Lazy Loading, etc.). +3 años en JavaScript y CSS. +2 años en Tailwind, Testing (Jest/Cypress), y Seguridad Web. +1 año integrando con SSO. -Contrato estable a término indefinido. - Horario: lunes a viernes - Salario $8.000.000 Palabras clave: developer, programador, senior, sr Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "Importante empresa del sector",
    "fecha_publicacion": "2025-09-23T05:12:19.381920",
    "fuente": "Computrabajo",
    "id": 121,
    "titulo": "Desarrollador Senior Frontend",
    "ubicacion": "Bogotá, D.C., Bogotá, D.C.",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador-senior-frontend-bogota-en-bogota-dc-A61A8D817D10251F61373E686DCF3405#lc=ListOffers-Score4-19"
  },
  {
    "descripcion": "Estamos buscando un desarrollador full stack senior con entre 8 y 12 años de experiencia, capaz de liderar técnicamente el desarrollo de sistemas complejos y distribuidos. Este rol requiere autonomía total para tomar decisiones arquitectónicas, curiosidad técnica extrema y ownership completo desde el concepto hasta la puesta en producción. Buscamos a alguien con mentalidad de producto, que combine profundidad técnica con visión estratégica, y que quiera construir la plataforma que democratice el acceso a agentes de IA para automatización corporativa. Horario: Lunes a viernes de 1:00 am a 11:00 am (por cambios de horario en el país el horario está sujeto a cambios) Lo que harás Diseñar e implementar funcionalidades complejas en frontend y backend, con foco en rendimiento, escalabilidad y seguridad. Colaborar con el arquitecto para definir y ejecutar visiones técnicas ambiciosas. Integrar agentes de IA en tiempo real, APIs REST y WebSockets, y construir interfaces conversacionales. Participar en decisiones de producto, optimización de métricas de negocio y experimentación A/B. Liderar buenas prácticas de testing (TDD), documentación técnica y revisión de código. Stack y herramientas clave Backend Ruby on Rails (versión 8), Sidekiq, PostgreSQL avanzado, Redis. Diseño de APIs REST y GraphQL, microservicios, patrones de escalabilidad y seguridad (OAuth, JWT). Infraestructura autogestionada, contenedores Docker, CI/CD, observabilidad con Grafana. Frontend JavaScript/TypeScript avanzado, React/Vue/Angular, Hotwire, Tailwind. Herramientas modernas: Webpack, Vite, esbuild. UX engineering, microinteracciones, optimización de rendimiento. IA y agentes Integración de LLMs, LangChain, CrewAI, MCP (Model Context Protocol). Bases de datos vectoriales, embeddings, búsqueda semántica, patrones RAG. Interacciones en tiempo real vía WebSockets y SSE. DevOps y colaboración Kubernetes, AWS/GCP/Azure, Slack, Telegram, WhatsApp, Teams. Testing automatizado (90 %), TDD, documentación clara, metodologías ágiles. Políglota y explorador Experiencia con Python, Node.js, y curiosidad por lenguajes emergentes (Mojo, Crystal, Hexcute). Protocolos complejos: HTTP/2, gRPC, WebSocket. Perfil ideal Experiencia en startups o scale-ups, con capacidad para balancear velocidad y calidad. Inglés fluido para colaborar con equipos globales. Capacidad de aprendizaje rápido, criterio técnico sólido y enfoque en impacto de negocio. ¿Te apasiona construir sistemas que escalen, integren IA y generen impacto real? Este rol es para ti. Palabras clave: developer, programador, senior, sr Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,6 SOLVO S.A.S",
    "fecha_publicacion": "2025-09-23T14:50:36.937082",
    "fuente": "Computrabajo",
    "id": 122,
    "titulo": "Desarrollador fullstack Senior",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador-fullstack-senior-en-medellin-76ADA20E80C6805861373E686DCF3405#lc=ListOffers-Score5-5"
  },
  {
    "descripcion": "Buscamos un Desarrollador especializado en FlutterFlow, con experiencia en la creación de aplicaciones móviles y web mediante componentes visuales. Esta herramienta permite desarrollar interfaces y funcionalidades sin necesidad de escribir código manual en Dart, conectando acciones, eventos y flujos de datos de forma intuitiva. Horario: Lunes a viernes de 5:00 am a 3:00 pm - (por cambios de horario en el país el horario está sujeto a cambios). Responsabilidades: Desarrollar e implementar aplicaciones móviles y web con FlutterFlow. Gestionar múltiples proyectos en simultáneo, según las necesidades del cliente. Integrar bases de datos como Firebase y configurar flujos de datos. Colaborar con el equipo de diseño y otros desarrolladores para crear interfaces funcionales y atractivas. Optimizar el rendimiento de las apps aplicando buenas prácticas de desarrollo. Incorporar funcionalidades avanzadas como notificaciones push, mapas y widgets personalizados. Participar en sesiones de revisión técnica y mejora continua. Requisitos: Dominio de FlutterFlow y sus funcionalidades clave. Conocimiento en Firebase, Firestore y Cloud Functions. Capacidad para crear widgets personalizados e integrar servicios externos. Familiaridad con metodologías ágiles (Scrum/Kanban). Experiencia en desarrollo de apps móviles, web y páginas web. Capacidad para proponer arquitectura de proyectos (no excluyente, pero valorado). Certificación en FlutterFlow (muy valorada). Experiencia mínima de 1 año; se priorizan perfiles entre 2 y 4 años. Habilidades para trabajar en equipo y gestionar proyectos en paralelo. Palabras clave: developer, programador Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,6 SOLVO S.A.S",
    "fecha_publicacion": "2025-09-24T09:50:36.954941",
    "fuente": "Computrabajo",
    "id": 123,
    "titulo": "Desarrollador Flutterflow",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador-flutterflow-en-medellin-BDACEA1BD9A27A7461373E686DCF3405#lc=ListOffers-Score5-8"
  },
  {
    "descripcion": "Estamos buscando un desarrollador full stack senior con entre 8 y 12 años de experiencia, capaz de liderar técnicamente el desarrollo de sistemas complejos y distribuidos. Este rol requiere autonomía total para tomar decisiones arquitectónicas, curiosidad técnica extrema y ownership completo desde el concepto hasta la puesta en producción. Buscamos a alguien con mentalidad de producto, que combine profundidad técnica con visión estratégica, y que quiera construir la plataforma que democratice el acceso a agentes de IA para automatización corporativa. Horario: Lunes a viernes de 1:00 am a 11:00 am (por cambios de horario en el país el horario está sujeto a cambios) Lo que harás Diseñar e implementar funcionalidades complejas en frontend y backend, con foco en rendimiento, escalabilidad y seguridad. Colaborar con el arquitecto para definir y ejecutar visiones técnicas ambiciosas. Integrar agentes de IA en tiempo real, APIs REST y WebSockets, y construir interfaces conversacionales. Participar en decisiones de producto, optimización de métricas de negocio y experimentación A/B. Liderar buenas prácticas de testing (TDD), documentación técnica y revisión de código. Stack y herramientas clave Backend Ruby on Rails (versión 8), Sidekiq, PostgreSQL avanzado, Redis. Diseño de APIs REST y GraphQL, microservicios, patrones de escalabilidad y seguridad (OAuth, JWT). Infraestructura autogestionada, contenedores Docker, CI/CD, observabilidad con Grafana. Frontend JavaScript/TypeScript avanzado, React/Vue/Angular, Hotwire, Tailwind. Herramientas modernas: Webpack, Vite, esbuild. UX engineering, microinteracciones, optimización de rendimiento. IA y agentes Integración de LLMs, LangChain, CrewAI, MCP (Model Context Protocol). Bases de datos vectoriales, embeddings, búsqueda semántica, patrones RAG. Interacciones en tiempo real vía WebSockets y SSE. DevOps y colaboración Kubernetes, AWS/GCP/Azure, Slack, Telegram, WhatsApp, Teams. Testing automatizado (90 %), TDD, documentación clara, metodologías ágiles. Políglota y explorador Experiencia con Python, Node.js, y curiosidad por lenguajes emergentes (Mojo, Crystal, Hexcute). Protocolos complejos: HTTP/2, gRPC, WebSocket. Perfil ideal Experiencia en startups o scale-ups, con capacidad para balancear velocidad y calidad. Inglés fluido para colaborar con equipos globales. Capacidad de aprendizaje rápido, criterio técnico sólido y enfoque en impacto de negocio. ¿Te apasiona construir sistemas que escalen, integren IA y generen impacto real? Este rol es para ti. Palabras clave: developer, programador, senior, sr Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,6 SOLVO S.A.S",
    "fecha_publicacion": "2025-09-23T14:50:36.964659",
    "fuente": "Computrabajo",
    "id": 126,
    "titulo": "Desarrollador fullstack Senior",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador-fullstack-senior-en-medellin-76ADA20E80C6805861373E686DCF3405#lc=ListOffers-Score6-0"
  },
  {
    "descripcion": "¡Estamos buscando talento para nuestro equipo de desarrollo! Vacante: Desarrollador Fullstack (JavaScript) Ubicación: Medellín (Edificio Forum  El Poblado) Modalidad: Híbrida (2 días en oficina / 3 desde casa) Horario: Lunes a viernes de 7:30 a.m. a 5:30 p.m. Contrato: Término indefinido Salario: $5.000.000 a $6.000.000 COP (según experiencia) Requisitos: Tecnólogo o profesional en Ingeniería de Sistemas o Ingeniería Informática Mínimo 3 años de experiencia comprobable en desarrollo de software Dominio de Node.JS, Angular.JS y JavaScript Experiencia con SQL Server Deseable conocimiento en PL/SQL y manejo de sistemas operativos Habilidad para trabajar con web services, pruebas unitarias y procesos de integración Tus funciones incluirán: Monitorear y gestionar el rendimiento de aplicaciones web Atender incidencias y requerimientos técnicos de manera efectiva Desarrollar y mejorar funcionalidades en aplicaciones web Participar en la implementación de tecnologías back y front Colaborar en procesos de soporte, documentación y mejora continua ¿Qué ofrecemos? Contrato directo e indefinido Modalidad híbrida con excelente ubicación en Medellín Proyectos retadores en entornos tecnológicos modernos Oportunidades de formación continua y desarrollo profesional Un ambiente de trabajo colaborativo, flexible y orientado a la innovación ¿Te interesa? ¡Postúlate y haz parte de un equipo donde tu talento impulsa grandes soluciones Palabras clave: developer, programador Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,6 Adecco Colombia S.A.",
    "fecha_publicacion": "2025-09-21T10:50:36.967859",
    "fuente": "Computrabajo",
    "id": 127,
    "titulo": "Desarrollador Fullstack (JavaScript)",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador fullstack-javascript-en-medellin-0D8410FAD864AF9261373E686DCF3405#lc=ListOffers-Score6-1"
  },
  {
    "descripcion": "Somos Fastco Group una compañía multinacional Líder de Contact Center, con más de 23 años de trayectoria, presencia en 5 países (Chile, Colombia, Perú, EE.UU. y España) y un firme compromiso con la transformación digital del Contact Center. Nos encontramos en la búsqueda de un(a) Desarrollador(a) Fullstack Senior con sólida experiencia técnica, visión estratégica, foco en Python y experiencia comprobada en frameworks para agentes de IA como LangChain y LangGraph, para unirse al equipo de Innovación Tecnológica. Requisitos: - Formación académica a nivel profesional o técnico profesional en las áreas de informática, programación, desarrollo de software, tecnología, inteligencia artificial, o carreras afines. - Experiencia en desarrollo de software, con participación en proyectos complejos o de alta demanda. - Dominio de Python, con enfoque en orquestación, automatización y procesamiento de lenguaje natural. - Experiencia comprobable usando LangChain y LangGraph, incluyendo diseño de flujos, agentes, herramientas y memory. - Conocimiento de IA generativa y uso de LLMs para tareas prácticas (ej: automatizar llamadas, evaluar calidad, generar acciones). - Conocimientos de desarrollo frontend con Vue 3 y TypeScript para construir interfaces operativas modernas. - Conocimiento de integración con servicios externos vía API, flujos de negocio y automatización de procesos. - Experiencia en infraestructura cloud (AWS) y despliegue de soluciones escalables. -  Habilidad para diseñar arquitecturas modulares, reutilizables y seguras. Perfil profesional que buscamos: - Autonomía para diseñar y entregar soluciones end-to-end. - Pensamiento estructurado y enfoque práctico. - Curiosidad por lo nuevo: no solo usar IA, sino programarla. - Buena comunicación con equipos no técnicos. - Mentalidad de mejora continua y ganas de experimentar con tecnologías emergentes. Ofrecemos: •Contrato a término indefinido •Salario competitivo acorde al mercado. •Participación en proyectos desafiantes y de alto impacto en innovación tecnológica. •Autonomía técnica y espacio para experimentar con nuevas herramientas. •Cultura de trabajo ágil, colaborativa y orientada a generar valor real. •Modalidad híbrida. •Contrato directo con la empresa y oportunidades de desarrollo profesional. •Excelente ambiente laboral y cultura organizacional basada en el compromiso, la innovación y el bienestar. Si buscas llevar tu carrera al siguiente nivel y construir soluciones innovadoras desde la tecnología y la IA, postula y únete a un gran equipo. Adjúntanos tu CV actualizado por este medio Palabras clave: senior, sr Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,2 Fastco SAS",
    "fecha_publicacion": "2025-09-24T10:06:36.970768",
    "fuente": "Computrabajo",
    "id": 128,
    "titulo": "Desarrollador(a) Fullstack Senior – Agentes de IA y Orquestación con Python Híbrido",
    "ubicacion": "Bogotá, D.C., Bogotá, D.C.",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrolladora-fullstack-senior-agentes-de-ia-y-orquestacion-con-python-hibrido-en-bogota-dc-F1788C429F8C0DF061373E686DCF3405#lc=ListOffers-Score4-14"
  },
  {
    "descripcion": "Se requiere desarrollador de software con conocimientos en SQL Server, ASP.Net Core C #, Angular, Bootstrap, JavaScript, HTML, CSS y TypeScript. Responsabilidades: Diseñar y desarrollar módulos en nuestra aplicación web, con altos estándares de eficiencia y calidad Realizar pruebas de unidad y de integración para garantizar la estabilidad y el rendimiento de la aplicación Mantenerse actualizado en las últimas tendencias y avances en desarrollo de software Documentar el código y los procesos técnicos de manera clara y concisa Formación: Tecnólogo, Ingeniero de Sistemas o afines. Habilidades: iniciativa, capacidades analíticas e investigativas, orientación al detalle y al logro. Experiencia: 2 años en el área de desarrollo. Palabras clave: analyst, developer, programador Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,5 UBIQUO TELEMEDICINA S.A.S",
    "fecha_publicacion": "2025-09-22T10:50:36.958202",
    "fuente": "Computrabajo",
    "id": 124,
    "titulo": "analista desarrollador",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-analista-desarrollador-en-medellin-9CCF047915355F6761373E686DCF3405#lc=ListOffers-Score5-11"
  },
  {
    "descripcion": "Se busca desarrollador con experiencia practica en backend usando Laravel, NestJS y FastAPI, asi como en la creación de APIs RESTful siguiendo buenas prácticas. En frontend, debe dominar Vue 2 y Vuetify para construir interfaces responsivas. Se requiere manejo de bases de datos PostgreSQL y MySQL, conocimientos en Docker, GitHub Actions  para CI/CD y uso de Redis para optimización del rendimiento. Requisitos: -Experiencia de 2 a 4 años en desarrollo web. -Laravel: Controladores, modelos, relaciones Eloquent, validaciones, middleware básico. -NestJS: Estructura modular básica, DTOs, servicios, controladores. -Python: Fundamentos con FastAPI o Django para construir APIs REST. -Vue 2 + vuetify. -Git: Buen manejo de ramas y resolución de conflictos. Deseables: -Manejo básico de Docker. -Postman para pruebas. -JWT y manejo de tokens en frontend. -Conocimientos básicos de accesibilidad y diseño responsivo. Salario: $6400000+ prestaciones sociales. Palabras clave: developer, programador Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,5 Sumimedical",
    "fecha_publicacion": "2025-09-22T10:50:36.961448",
    "fuente": "Computrabajo",
    "id": 125,
    "titulo": "Desarrollador intermedio",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador-intermedio-en-medellin-56ABADDC5DBB315D61373E686DCF3405#lc=ListOffers-Score5-13"
  },
  {
    "descripcion": "Importante empresa de tecnologia requiere para su equipo de trabajo un Desarrollador Fullstack que cuente con 3 años de experiencia en desarrollo con lenguajes JavaScript - React Native, Python - Django en cargos similares Salario: A convenir en dólares Modalidad: Remoto Tipo de contrato: Prestación de servicios Palabras clave: developer, programador, casa, remoto, remote, teletrabajo, home Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,4 ZEMSANIA COLOMBIA SAS",
    "fecha_publicacion": "2025-09-22T10:50:36.973696",
    "fuente": "Computrabajo",
    "id": 129,
    "titulo": "Desarrollador Fullstack react python",
    "ubicacion": "Bogotá, D.C., Bogotá, D.C.",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador-fullstack-react-python-remoto-freelance-en-bogota-dc-F6DE27B2F1B8F59761373E686DCF3405#lc=ListOffers-Score4-17"
  },
  {
    "descripcion": "Perfil: Titulado en:tecnologo en Ingeniería de sistemas, Electrónica o a fines. Con Experiencia Mínimo de 2 años en cargos similares, en React Native (CLI y Expo) y backend con NodeJS, TypeScript, Python y NestJS. El rol implica desarrollar productos de extremo a extremo, incluyendo interfaces móviles y servicios escalables en la nube. Se requiere manejo de Redux, React Navigation, Firebase, APIs REST/GraphQL, Docker, Swagger, Jest y SonarQube. Además, debe dominar servicios de AWS como Lambda, Cognito, S3, EC2 y bases de datos PostgreSQL y MongoDB. Valoramos buenas prácticas como SOLID, Clean Code, GitFlow, y trabajo ágil con Scrum. Condiciones Contrato a termino Indefinido Salario de 5.800.000 nomimal Modalidad 100% Remota Beneficios adicionales Palabras clave: developer, programador Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "CARVAJAL TECNOLOGIA Y SERVICIOS S.A.S",
    "fecha_publicacion": "2025-09-22T10:50:36.976457",
    "fuente": "Computrabajo",
    "id": 130,
    "titulo": "Desarrollador/a Fullstack",
    "ubicacion": "Bogotá, D.C., Bogotá, D.C.",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrolladora-fullstack-react-native-nodejs-aws-en-bogota-dc-1E08AE7858F793DA61373E686DCF3405#lc=ListOffers-Score4-18"
  },
  {
    "descripcion": "Importante empresa del sector de tecnología e innovación, ubicada en Medellín, solicita para su equipo de trabajo, personal con experiencia mínima de 6 meses para desempeñar el cargo de diseñador/a UI/UX. Formación académica: profesional en Diseño gráfico, Interacción HumanoComputadora o áreas afines. Funciones específicas - Desarrollar user personas, journey maps y flujos de navegación optimizados para baja alfabetización digital. - Asegurar accesibilidad bajo estándares WCAG y diseño mobile first. - Diseñar flujos que reduzcan la ansiedad del usuario (lenguaje positivo en recordatorios de pago). - Iterar diseños con base en pruebas A/B y feedback real. - Trabajar estrechamente con desarrolladores Frontend (React Nextjs) para asegurar fidelidad del diseño. Conocimientos: - Comunicación clara y efectiva para transmitir hallazgos de investigación y propuestas de diseño. - Capacidad para sintetizar información compleja en mensajes simples y persuasivos. - Presentación de ideas visuales y argumentación con fundamentos técnicos y de experiencia de usuario. - Herramientas de prototipado: Figma, Adobe XD, ProtoPie. - Principios de accesibilidad digital (WCAG). - Diseño responsive y mobile-first. - Creación de user personas, journey maps y pruebas de usabilidad. - Métricas UX (tiempo de tarea, tasa de error). - Conocimientos básicos en HTML, CSS y React. Salario: $1.800.000 a $2.000.000 según experiencia + prestaciones de ley. Horarios: lunes a viernes 7:00 a.m. a 5:00 p.m. y 4 horas los sábados. Tipo de contrato: Fijo. Lugar de trabajo: Medellín, modalidad híbrida. Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,8 AGENCIA DE EMPLEO COMFAMA",
    "fecha_publicacion": "2025-09-23T21:50:36.979870",
    "fuente": "Computrabajo",
    "id": 131,
    "titulo": "Diseñador/a UI/UX",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-disenadora-uiux-en-medellin-EB90104F197D70E361373E686DCF3405#lc=ListOffers-Score5-6"
  },
  {
    "descripcion": "Estamos buscando un desarrollador full stack senior con entre 8 y 12 años de experiencia, capaz de liderar técnicamente el desarrollo de sistemas complejos y distribuidos. Este rol requiere autonomía total para tomar decisiones arquitectónicas, curiosidad técnica extrema y ownership completo desde el concepto hasta la puesta en producción. Buscamos a alguien con mentalidad de producto, que combine profundidad técnica con visión estratégica, y que quiera construir la plataforma que democratice el acceso a agentes de IA para automatización corporativa. Horario: Lunes a viernes de 1:00 am a 11:00 am (por cambios de horario en el país el horario está sujeto a cambios) Lo que harás Diseñar e implementar funcionalidades complejas en frontend y backend, con foco en rendimiento, escalabilidad y seguridad. Colaborar con el arquitecto para definir y ejecutar visiones técnicas ambiciosas. Integrar agentes de IA en tiempo real, APIs REST y WebSockets, y construir interfaces conversacionales. Participar en decisiones de producto, optimización de métricas de negocio y experimentación A/B. Liderar buenas prácticas de testing (TDD), documentación técnica y revisión de código. Stack y herramientas clave Backend Ruby on Rails (versión 8), Sidekiq, PostgreSQL avanzado, Redis. Diseño de APIs REST y GraphQL, microservicios, patrones de escalabilidad y seguridad (OAuth, JWT). Infraestructura autogestionada, contenedores Docker, CI/CD, observabilidad con Grafana. Frontend JavaScript/TypeScript avanzado, React/Vue/Angular, Hotwire, Tailwind. Herramientas modernas: Webpack, Vite, esbuild. UX engineering, microinteracciones, optimización de rendimiento. IA y agentes Integración de LLMs, LangChain, CrewAI, MCP (Model Context Protocol). Bases de datos vectoriales, embeddings, búsqueda semántica, patrones RAG. Interacciones en tiempo real vía WebSockets y SSE. DevOps y colaboración Kubernetes, AWS/GCP/Azure, Slack, Telegram, WhatsApp, Teams. Testing automatizado (90 %), TDD, documentación clara, metodologías ágiles. Políglota y explorador Experiencia con Python, Node.js, y curiosidad por lenguajes emergentes (Mojo, Crystal, Hexcute). Protocolos complejos: HTTP/2, gRPC, WebSocket. Perfil ideal Experiencia en startups o scale-ups, con capacidad para balancear velocidad y calidad. Inglés fluido para colaborar con equipos globales. Capacidad de aprendizaje rápido, criterio técnico sólido y enfoque en impacto de negocio. ¿Te apasiona construir sistemas que escalen, integren IA y generen impacto real? Este rol es para ti. Palabras clave: developer, programador, senior, sr Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,6 SOLVO S.A.S",
    "fecha_publicacion": "2025-09-23T14:50:36.982828",
    "fuente": "Computrabajo",
    "id": 132,
    "titulo": "Desarrollador fullstack Senior",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador-fullstack-senior-en-medellin-76ADA20E80C6805861373E686DCF3405#lc=ListOffers-Score5-7"
  },
  {
    "descripcion": "Se busca desarrollador con experiencia practica en backend usando Laravel, NestJS y FastAPI, asi como en la creación de APIs RESTful siguiendo buenas prácticas. En frontend, debe dominar Vue 2 y Vuetify para construir interfaces responsivas. Se requiere manejo de bases de datos PostgreSQL y MySQL, conocimientos en Docker, GitHub Actions  para CI/CD y uso de Redis para optimización del rendimiento. Requisitos: -Experiencia de 2 a 4 años en desarrollo web. -Laravel: Controladores, modelos, relaciones Eloquent, validaciones, middleware básico. -NestJS: Estructura modular básica, DTOs, servicios, controladores. -Python: Fundamentos con FastAPI o Django para construir APIs REST. -Vue 2 + vuetify. -Git: Buen manejo de ramas y resolución de conflictos. Deseables: -Manejo básico de Docker. -Postman para pruebas. -JWT y manejo de tokens en frontend. -Conocimientos básicos de accesibilidad y diseño responsivo. Salario: $6400000+ prestaciones sociales. Palabras clave: developer, programador Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,5 Sumimedical",
    "fecha_publicacion": "2025-09-22T10:50:36.985781",
    "fuente": "Computrabajo",
    "id": 133,
    "titulo": "Desarrollador intermedio",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador-intermedio-en-medellin-56ABADDC5DBB315D61373E686DCF3405#lc=ListOffers-Score5-9"
  },
  {
    "descripcion": "Se busca desarrollador con experiencia practica en backend usando Laravel, NestJS y FastAPI, asi como en la creación de APIs RESTful siguiendo buenas prácticas. En frontend, debe dominar Vue 2 y Vuetify para construir interfaces responsivas. Se requiere manejo de bases de datos PostgreSQL y MySQL, conocimientos en Docker, GitHub Actions para CI/CD y uso de Redis para optimización del rendimiento. Requisitos: Requisitos: -Experiencia de 5 años en desarrollo, incluyendo liderazgo técnico. -Laravel:  Patrones, repositorio, servicios, eventos, jobs. -NestJS:  Arquitectura avanzada (Módulos, interceptores, guards, pipes). -Python: Fundamentos con FastAPI o Django para construir APIs REST. -Vue 2 + vuetify. -DevOps básico: Docker, CI/CD, versionado semántico. -Profundo conocimiento de uso de Redis. Deseables: -Experiencia en liderazgo de equipo. -Participación en definición de arquitectura de Frontend /backend. -Buen criterio UI/UX. Documentación técnica (Open API, Swagger, Markdown interna). Salario: A convenir de acuerdo a experiencia laboral. Palabras clave: developer, programador, senior, sr Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "4,5 Sumimedical",
    "fecha_publicacion": "2025-09-22T10:50:36.988522",
    "fuente": "Computrabajo",
    "id": 134,
    "titulo": "Desarrollador senior",
    "ubicacion": "Medellín, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-desarrollador-senior-en-medellin-BEDC4536ABE7A68161373E686DCF3405#lc=ListOffers-Score5-10"
  },
  {
    "descripcion": "Estamos en búsqueda de Desarrolladores Full Stack que deseen unirse a un equipo dinámico y aportar en la creación de productos digitales innovadores con impacto real. Responsabilidades Desarrollar y mantener aplicaciones web y móviles. Diseñar e implementar APIs y servicios backend eficientes. Colaborar con los equipos de diseño y producto para crear interfaces modernas y fáciles de usar. Garantizar la calidad del código, optimizar el rendimiento y participar en revisiones técnicas. Mantenerse actualizado con las últimas tendencias y tecnologías. Requisitos Experiencia en desarrollo frontend con React, Angular o Vue.js. Conocimientos sólidos en backend con Node.js, Python, Java o PHP. Experiencia en desarrollo de aplicaciones móviles nativas o híbridas. Manejo de bases de datos SQL y NoSQL. Experiencia en sistemas de control de versiones (preferiblemente Git). Proactividad, capacidad de trabajo en equipo y autonomía. Se valorará Experiencia con servicios en la nube (AWS, Azure o GCP). Conocimientos en diseño UI/UX. Certificaciones o proyectos relevantes en desarrollo de software. Palabras clave: engineers, ingeniera, ing, engineer Competencias añadidas por la empresa El equipo reclutador buscará estos conocimientos y habilidades en las postulaciones. Añade las que te faltan a tu perfil para atraer su atención. Puedes gestionar todas tus aptitudes en tu perfil.",
    "empresa": "PEDBOX S.A.S.",
    "fecha_publicacion": "2025-09-21T10:50:36.991559",
    "fuente": "Computrabajo",
    "id": 135,
    "titulo": "Ingeniero de software",
    "ubicacion": "Itagüí, Antioquia",
    "url": "https://www.computrabajo.com.co/ofertas-de-trabajo/oferta-de-trabajo-de-ingeniero-de-software-frontend-backend-movil-en-itagui-19CC92DFF3CAE41461373E686DCF3405#lc=ListOffers-Score5-12"
  }
]